# 屏幕大小
screen = {
    "size": (800, 650),  # 屏幕的长宽
    "color": (255, 255, 255),  # 屏幕的背景颜色
}

# 地图大小
map = {
    "size": (21 * 23, 22 * 23),  # 地图的长宽
    "color": (10, 10, 10),  # 地图的背景颜色
    "start_point": (165, 100),  # 地图左上角和屏幕左上角的位置偏移
    "block_num": (21, 22),  # 地图中，包含的格子个数
}

# 单元格子大小
block = {
    "size": (23, 23),  # 单元格子的大小
    "color": (155, 155, 155),  # 单元格子的背景颜色
}

# 字体
text = {
    "size": 28,
    "style": "SimSun",
    "color": (0, 0, 0),
    "background": (255, 255, 255),
}

# 标签
lable = {
    "count": (120, 30),
    "try": (270, 30),
    "time": (420, 30),
    "score": (570, 30),
}

answer = {
    "size": (100, 50),
    "answer1_pos": (30, 150),
    "answer2_pos": (30, 250),
    "answer3_pos": (30, 350),
    "answer4_pos": (30, 450)
}
